'{"Which one of the following consequences is most likely to occur when passing user input directly to the exec() function?":"Command Injection. ","Which one of the following consequences is more likely to occur when connecting to databases with privileged user accounts?":"SQL Injection. ","Which one of the following cookie settings can be used to prevent client-side scripts from accessing cookies? ":"httpOnly","Which one of the following best practices help prevent code injection attacks in Node.js applications?":"Use strong whitelist validation for user input. ","Which one of the following best practices should be used when loading AngularJS templates?":"Use Whitelists via resourceURLWhitelist when loading templates.","Node packages published in the Node Package Manager (NPM) are secure and can be trusted and used in the application.":"False","Quiz Results":"","Which one of the following best practices can be used to prevent XSS? ":"All user input should be validated. ","When using TLS it is recommended to support TLS versions 1.1 and 1.2.":"True","This completes your exam attempt. If you wish to retake the exam please close this window and relaunch the course from within your training site.":"","Which one of the following is a key derivation function?":"PBKDF2","Which one of the following is a benefit of distributing a public key in the form of an x.509 certificate?":"A certificate contains information about the key’s signer","A digital signature can:":"Detect any modifications made to a document","For secure data transfer, data encrypted with a ____________ key can be decrypted with the corresponding ______________ key.":"Public, private","To ensure that a certificate can be trusted, you should always verify the Issue date and expiration date.":"True","AES provides a good balance of speed and strength and is suitable for most applications.":"True","What is the purpose of encrypting with the private key and decrypting with a public key?":"This is verifying a digitally signed message came from a sender in possession of the private key","Which one of the following is the best choice for generating random numbers suitably secure for most Java applications?":"SecureRandom","Digital signatures provide a guarantee that the signed data has not changed or been tampered with since signing.":"True","A digital signature guarantees that the owner of the signing key produced the signature.":"False","Denial of service that results in the application crashing usually happens when there are ____________________________________________________.":"logical errors or an unhandled error condition in the application code","Which one of the following is not a recommended best practice for secure error handling?":"Leaving error handling to the choice of individual coders","To prevent null dereference vulnerabilities, check ___________________________before using them.":"object references for null","Regular expression denial of service attacks results in the vulnerable application taking up a lot of CPU time and/or memory and potentially causing the system to become _________________________.":"unresponsive ","Null pointer dereference vulnerabilities occur when the application attempts to use an object reference that has a ________________ as if it has a valid value.":"null value","Validate the _____________________ of any untrusted data first before passing it to regular expressions.":"length","Denial of service that results in the application performing some kind of malicious and destructive action usually ____________________________________________.":"stems from insufficient authorization controls on dangerous functionality","Using excessive cloud resources can translate directly into financial costs.":"True","Regular expressions are often used to validate untrusted data.":"True","The computational complexity of vulnerable regular expressions increases linearly with the length of the input.":"False","________________________might allow attacks to go unnoticed or result in Denial of Service conditions.":"Unchecked error conditions","Denial of service (DoS) vulnerabilities occur when the application can be manipulated to _____________________.":"use an excessive amount of system resources","The recommended way to prevent XXE vulnerabilities is to ___________________.":"configure all XML parsers to ignore external entities completely","Grouping with repetition looks like (regex1)regex2, where _______________________________________________________________________________.":"regex1 is any regular expression pattern that matches strings of variable length, and regex2 is any wildcard or repetition operator","Placing exception handlers _____________________ allows the application to have better information of the current operation and properly recover the appropriate resources.":"closer to the exception source","If your log files do not contain personally identifiable information, then they are not of use to attackers.":"False","To prevent regular expression denial of service attacks caused by malformed data, validate the length of data after passing it to regular expressions.":"False","A Trusted Platform Module (TPM) can be used for:":"Managing cryptographic keys","Command injection most likely exploits:":"Lack of validating untrusted input","A restore feature should:":"Recover the system from a previous backup","Ways that may be provided by the hardware or the operating system to mitigate memory corruption vulnerabilities include all of the following except:":"Trusted Platform Module (TPM)","Which one of the following is most likely caused by memory corruption on embedded systems?":"Remote code execution","The presence of a digital signature on an update package is sufficient to guarantee its authenticity.":"False","Injection vulnerabilities are prevented by combining data with code.":"False","To maintain high security standards, you should deliver security updates over the Internet frequently.":"False","Deploying an embedded system device in a physical location where it is not easily accessible is sufficient to ensure security.":"False","The availability of remote services such as cloud storage and backups could possibly make an embedded system less secure.":"True","This completes your exam attempt. If you wish to retake the exam, please close this window and relaunch the course from within your training site.":"","Azure Sentinel:":"Collects and analyzes logging data to identify threats","Azure provides DDoS protection from attacks against:":"The network layer and application layer ","Which of the following is not a security feature provided with Azure Active Directory?":"Tools for creating custom cryptographic solutions","Azure Security Center:":"Analyzes your security posture and provides recommendations","The Azure Information Protection (AIP) service provides which of the following features?":"Persistent classification, protection, and tracking security controls on shared data","The Azure Active Directory must be manually activated in order to be used by virtual machines.":"False","The Azure Application Gateway is a physical hardware appliance that allows distribution of traffic and URL path-based routing.":"False","Associated with the user’s subscription, Azure provides a default domain controller hosting Active Directory that can be selected at virtual machine creation time.":"True","You must provide your own encryption solution for the data stored on virtual disks used by Azure Virtual Machines.":"False","Azure Storage uses Storage Service Encryption (SSE) to encrypt data in transit.":"False","In order to configure your AWS WAF, what do you need to create? ":"Web ACL ","What increments does AWS recommend using for Network ACL rule numbers? ":"100s","What kind of secrets can Secrets Manager store? ":"Passwords and API Keys","What do you need to setup in order to use CloudWatch to identify attacks?":"CloudWatch Event","What service do you use to detect active threats? ":"GuardDuty","What can you do with the key_mgmt_util?":"Create, import, export, and delete keys","What controls the access in network ACLs?":"Inbound and outbound rules","What environment does AWS Security Hub provide a centralized view of for you?":"AWS environment","What is the default setting for auto-rotation of secrets? ":"Disabled","What information can you gather from the IAM Welcome screen?":"IAM user sign-in link, IAM resources, and Security Status","How do you identify your custom key in AWS KMS? ":"Alias","AWS GuardDuty is:":"A threat detection service that actively monitors and protects your AWS accounts ","How do you access the IAM service in the AWS Console?":"Logon to AWS Console > click Services > Select “IAM”","In a VPC, a Security Group: ":"Is a virtual firewall that controls traffic to one or more EC2 instances ","With IAM, what kind of access to AWS can you give to a user? ":"Both a) and b)","How is CloudHSM deployed?":"In a cluster","With AWS KMS, you can give administrative and usage permissions for a key to the same individual.":"True","You must apply tags to your user, roles, secrets, and keys.":"False","You can place a WAF in front of your CloudFront distribution.":"True","AWS Shield is automatically enabled when you create your AWS Account. ":"True","What do you use groups for in IAM?":"To group users together who need the same access","What service do you use to scan your AWS resources for vulnerabilities?":"Inspector","What service do you use to view the overall security of your AWS environment?":"Security Hub","What is the recommended action to take for inactive or compromised keys?":"Disable","From the IAM Welcome screen, which menu option allows you to set your password policy? ":"Account settings","What do you need to setup an AWS Firewall Manager administrator account? ":"AWS account number ","What else needs to be enabled in order for AWS SSO to become enabled?":"AWS Organizations ","What are the three items does IAM use to administer access to all resources in AWS? ":"Users, Groups, and Roles","You can use an agent-based Inspector collector on your EC2 instances. ":"True","AWS Firewall Manger will ask you to confirm your choice of administrator. ":"True","Best practices for hardening a virtual machine include all of the following except:":"Update only every 3 months","Which of the following features are provided by Azure Key Vault?":"Encrypts secrets such as authentication keys, certificates, and passwords in HSMs","Features and mechanisms that would best help you secure your virtual network infrastructure are:":"Azure VPN Gateway and Network Security Groups","The Azure Key Vault interface only supports Azure HDInsight as a source for security information.":"False","Azure’s Role-based Access Control is set globally for all services at once.":"False"," Azure Storage uses Storage Service Encryption (SSE) to encrypt data in transit.":"False","What does Role-Based Access Control in Azure do?":"Grants or denies permissions based on users’ membership in a given group","In the Role-based Access Control authorization paradigm permissions are granted or denied based on group membership.":"True","The Azure Security Center agent that analyzes data using machine learning algorithms can be deployed on machines that are not in the cloud.":"False","Best practices for managing secrets include all the following except:":"Secrets must be visible to all applications","Which of the following security strategies would be best suited for a cloud infrastructure?":"Centralized logging ","When comparing security of a cloud provider’s infrastructure vs an organization’s own deployment, which of these areas might favor the organization’s own deployment? ":"Trust ","Which of the following is a best practice for securing VMs and containers?":"Be aware of and apply provider-specific security recommendations"," be an advantage of using tags or labels?":"Managing secrets ","Which approach would be most suitable for authorizing user access to cloud resources?":"Mapping users to roles and further controlling access with resource tags or labels","Which of the following is the least important when making security part of the deployment configuration?":"The ability to quickly modify settings as necessary","A software-defined network might be made up of multiple physical networks but appear to users as one. ":"True","Multitenancy is a more pressing compliance consideration than jurisdictional boundaries when moving to the cloud. ":"False","The distributed nature of cloud infrastructure can limit exposure to some security risks. ":"True","The ability to script identity and access management configuration provides all of the following except: ":"Searching, reporting, and tracking costs ","Which of the following strategies would be best suited for securing a cloud infrastructure?":"Treating every resource as an independent, securable entity ","Which of the following is poor advice for securing containers?":"Always deploy container applications using public or community repositories","Outsourcing file storage and sensitive IT operations to the cloud transfers all responsibility for security to the cloud service provider. ":"False","Which of the following is true concerning Single Sign-On (SSO)? ":"OpenID Connect is an authentication layer on top of OAuth2","All of the following are advantages of a managed access approach except:":"Granting permissions by department ","Complying with local laws and other jurisdictional considerations is the sole responsibility of the cloud provider. ":"False","Object storage is a scalable, distributed system for storing blobs of data (which could be files) independent of any operating system. ":"True","Which one of the following would be an output of the code review process?":"Prioritized list of problems to fix in the code","Which one of the following would best be used as an input for the code review process?":"Design documents and data flow diagrams","Which step is a part of the code review process?":"Conducting a preliminary scan","What should you do to avoid spending too much time on one particular issue during code review?":"Time-box your efforts","Which one of the following best practices is most likely to help you set clear code review objectives?":"Understanding the key threats for the application","What should you do to analyze trust boundaries?":"Perform a data flow analysis","It is recommended that security code reviews be performed ____ for best effectiveness:":"Throughout development and testing","What should you do to reduce problems that occur repeatedly in your code?":"Update your coding standards","Which one of the following steps should you perform as part of a control flow analysis?":"Step through logical conditions in the code","A security code review consists of only manual inspection of code. ":"False","A preliminary scan helps you:":"Identify hotspots where more bugs may be hidden","In which step of a security code review are data flow and control flow analyses performed?":"Reviewing for common security issues","Identify the best practice that helps you save time when performing a code review.":"Clarify what you will not be looking for","Which one of the following factors should you consider when you are creating a list of inspection questions to determine the focus of the security code review?":"Types of problems that are possible due to the technology used","Which action should you take as a part of the post-code review process?":"Evaluate the maximum damage potential of bugs found","All of the following are characteristics of a key derivation function except:":"It should increase key length to compensate for weak user passwords","A cross-site request forgery attack sends a malicious request to a target site. Which one of the following is not true of a successful CSRF attack?":"The malicious request is accompanied by the attacker’s credentials","Ajax uses XMLHttpRequest in order to:":"Conduct asynchronous interactions between the browser and the server","It may be difficult to automate testing for an Ajax application, due to:":"Page contents that change at unexpected intervals","Which one of the following statements is true of an injection attack?":"The attacker may be enabled to read, change, and delete data available to the application","How do you best classify an XML External Entities attack?":"Injection","SOAP messages are formatted using:":"XML","XPath query syntax is similar to:":"URIs and file paths","An attacker visits a discussion forum site and posts a message containing an embedded script. When an unsuspecting user visits the forum, his browser loads the message and executes the script. This is an example of a:":"Persistent XSS attack","In a reflective cross-site scripting attack:":"The attacker’s script is not stored on the target website","Which one of the following is not a core technology of Ajax? ":"Cascading Style Sheet","Which one of the following does an injection attack “trick” into executing the malicious command?":"The interpreter","Which one of the following statements best characterizes Ajax?":"A collection of web technologies used together for application development","XML Path Language (XPath) is used to:":"Query nodes in an XML document ","An attacker sends deeply nested XML elements causing a DOM parser to allocate memory for each element. Which one of the following attacks is the attacker performing?":"Coercive Parsing Attack","In a cross-site scripting attack, an attacker supplies malicious input that contains an embedded script. The attack may succeed if:":"The application does not validate input","Which one of the following is a security risk commonly associated with Ajax applications?":"Synchronization issues such as race conditions","Which one of the following is a characteristic of the stack canary technique? ":"It detects buffer overflow incidents ","On embedded devices, which types of memory may provide security update functionality? ":"EEPROM","Which one of the following security statements is true for embedded systems? ":"Security expectations must be known, documented, and realistic ","What type of security risk is associated with a path traversal attack? ":"Access to confidential data ","Which one of the following techniques is used to mitigate race conditions? ":"Minimize the use of shared resources ","On embedded systems, semaphores: ":"Are used to lock access to shared memory ","Which one of the following could be affected by a stack-based buffer overflow? ":"Local variables ","Which one of the following is characteristic of a race condition? ":"It affects the integrity of shared variables ","Runtime errors differ from logic errors because: ":"They are caused by failure conditions that unexpectedly occur during runtime ","Which type of memory allows read and write operations and provides data persistence while powered off? ":"Flash","Which one of the following is a correct way to mitigate integer arithmetic overflows? ":"Use compiler-specific options or special libraries ","Which one of the following is used in a keyed hashing message authentication code? ":"Symmetric key ","Compared to desktop or server devices, memory on embedded devices:":"Is limited, expensive, and may not be expandable ","Advantech EKI-6340 is a wireless mesh access point used in industrial control systems. It was discovered that an attacker could inject an arbitrary OS command for execution because the manufacturer: ":"Failed to validate input parameters for the Web-based application ","Which one of the following is a general way to mitigate buffer overflows? ":"Validate data sizes ","Which one of the following will not help ensure secure data transfer over wireless networks? ":"Stack canary technique ","Smartphones are a good example of embedded devices because they have: ":"Limited memory and power supply ","Which one of the following is a characteristic of the Data Execution Prevention technique? ":"It is provided by hardware and OS software manufacturers ","Which one of the following is a correct practice to mitigate command injection?":"Validate all input parameters  ","Which one of the following will not mitigate risks associated with weak authentication? ":"Separate code and data instructions ","Which one of the following can be used to prevent SQL Injection?":"Prepared Statements","A Cross-Site Request Forgery (CSRF) vulnerability allows an attacker to:":"Execute actions on behalf of an authenticated user","Which one of the following is a best practice for protecting IoT web applications?":"Force change of default credentials","Which one of the following can be used to prevent XSS?":"Use white-list input validation","Which one of the following can be used to prevent account enumeration using new registration attempts?":"Use ambiguous error messages","Which one of the following actions should be used for key derivation algorithms to protect stored passwords?":"Hash both the password and the salt using multiple iterations","The following are best practices to prevent session IDs from guessing attacks, with an exception of?":"Protect session identifiers in transit using TLS","Which one of the following is a best practice for implementing authentication and authorization for the IoT?":"Enable management of authentication credentials","Which of the following is a benefit of using Multi-Factor Authentication (MFA)":"Makes password guessing attacks difficult","Which one of the following steps should be taken to correctly implement credential control?":"Identify password management functions","Buffer overflows often allow remote attackers to:":"Execute arbitrary code on a target system","Following are the best practices for securing network services on IoT devices, with an exception of?":"Use strong PRNGs","Following are best practices to mitigate memory corruption vulnerabilities, with an exception of?":"Use Third-party code","Following are examples of outdated protocols with known vulnerabilities, with an exception of?":"HTTPS","Invalid packets are typically used for outdated protocols:":"False","Which of the following is most likely to occur due to lack of transport encryption? ":"Exposes data in transit to interception","Which one of the following is not a general guideline for using TLS? ":"Use self-signed certificates ","Which one of the following can be used to ensure that the compromise of a session key will not allow for decryption of past or future communications?":"Perfect Forward Secrecy ","Which one of the following indicates that all traffic from a web site must communicate over HTTPS? ":"HTTP Strict Transport Security ","Metadata such as IP addresses are encrypted when using a TLS connection.":"False","Which one of the following is most likely to occur due to the use of default passwords during device setup?":"Gain access to poorly configured devices","Which one of the following prevention mechanisms can be used to prevent account enumeration?":"Throttle registration attempts","Which one of the following prevention mechanisms can be used to prevent an attacker from intercepting unencrypted credentials or decrypting a poorly encrypted connection? ":"Use of Transport Layer Security ","Which one of the following is most likely to occur due to lack of Jailbreak detection?":"Leakage of sensitive data in application memory","To protect credentials in memory, it is recommended to clear authentication credentials and other sensitive information from memory as quickly as possible.":"True","Which one of the following can be used to prevent attackers from tampering with or substituting update files?":"Sign and verify updates","Which of the following should not be included in update Files?":"Encryption Keys","Which one of the following can be used to prevent Bootkits?":"Secure Boot","Which of the following is most likely to occur due to lack of TLS while distributing updates?":"Man-in-the-Middle attacks","Which one of the following steps are performed in an automatic update process?":"Device periodically checks for new updates on the vendor server","Which one of the following provides fine-grained control over the type and source of web content? ":"Content Security Policy. ","Which one of the following best practices help prevent SQL injection attacks in Node.js applications?":"Use prepared statements with parameterized user input. ","Which one of the following best practices can be used to prevent command injection? ":"Find alternatives to native code for executing shell processes. ","AngularJS provides inbuilt methods to identify if templates have been compromised before loading the templates.":"False","A codesource is a combination of the classes loaded from a particular URL location or codebase and:":"Any digital signatures on that code ","Which one of the following checks does the bytecode verifier perform on a Java class?":"Static checks for proper syntax ","What is a protection domain?":"A collection of permissions applied to a particular codesource","Class loaders perform which of the following functions?":"Ensure the validity and integrity of the classes ","Which one of the following is a Java class loader?":"URL class ","If you do not identify a component, the applied permission is valid for all components hosted in the same Java application.":"True","A Java class needs to use the system classes to access protected resources such as the file system.":"True","Java applications invoke the checkPermission() method of SecurityManager to:":"Check if policy grants the requested permission ","Which one of the following is the responsibility of the bytecode verifier?":"To ensure the integrity of the file and its structures ","Which class is responsible for permission checks?":"AccessController","Java uses the SecurityManager class for all of the following except:":"Preventing Denial of Service attacks ","A security policy can be loaded programmatically.":"True","The JVM provides a default security manager for all applications.":"False","Which of the following is a best practice that must be used when authenticating a user over a network connection?":"Use Transport Layer Security ","JAAS uses _____ to determine a user’s permissions.":"Principals","Regarding login module flags, all of the following are false except:":"The “Required” flag guarantees that the login module blocks access if authentication fails","JAAS provides all of the following except:":"A proprietary authentication technology ","JAAS policies follow the same format as regular Java policies, except that they have an additional option to indicate the login module(s) to use.":"False","Which one of the following restricts permissions based on who logs into the application using subjects and principals?":"Java authentication and authorization services ","In JAAS, a user that has authenticated to the application is known as a:":"Subject","To authenticate a user with JAAS which of the following are required? ":"Public credentials and private credentials ","For a subject to perform a restricted operation, the current security policy must grant all of the subject’s principal’s permissions to perform that operation.":"False","How should components that are capable of producing any physical damage and the network be connected?":"They should be separate","The best way to reduce your attack surface with respect to user accounts is to:":"Disable the unused accounts","Throttling authentication attempts completely mitigates the vulnerability otherwise presented by weak passwords.":"False","Memory limitations are not an issue with designing embedded software as you can always add additional memory modules.":"False","Which of the following is the least likely to be a recommended practice?":"Configure the Admin system role as the default user","Running cryptographic services and public key infrastructure (PKI) on embedded systems requires no special considerations.":"False","Use of the eval function to evaluate and parse JSON data may increase the risk of XSS attacks because:":"eval() parses a script embedded in JSON data as JavaScript, enabling the script to execute","An XSS attack can enable the attacker to access internal browser objects, such as cookies, session IDs, and web form data that might contain sensitive information.":"True","An Ajax application can remain interactive while refreshing the browser because it refreshes the complete page rather than just part of it.":"False","In Ajax, response time is reduced because requests made to the server require relatively small responses.":"True","Server-side APIs help to conceal information from attackers about parameter types supported by the system.":"False","Which one of the following describes Key Derivation?":"It transforms a weak key into a strong key of sufficient length","Which one of the following risks can be prevented by the use of Initialization Vectors?":"Pattern recognition","Which one of the following is derived when plaintext is encrypted with a secret key?":"Ciphertext","What is the recommended key strength for Elliptic Curve cryptography?":"384-bit","Which one of the following cipher modes provides a mechanism to verify integrity or authenticity?":"CCM","Which one of the following can best be used to limit plaintext exposure of sensitive data in memory?":"Avoid creating multiple copies of sensitive data","Which one of the following random number functions can be used for cryptography applications?":"CryptGenRandom()","Which one of the following algorithms is the recommended choice for symmetric-key algorithms?":"AES-256","Modern operating systems isolate system memory, which helps prevent leakage of sensitive data in memory.":"False","Public key cryptography requires considerably more processing than symmetric cryptography.":"True","Which one of the following is the most common use of digital signatures in C++ programs?":"Verifying the integrity of data","Which one of the following transforms a weak key into a strong key of sufficient length?":"Key Derivation","Which type of cryptography uses the same key for encryption and decryption?":"Symmetric","Which one of the following libraries provides cryptographic operations on Windows?":"CryptoAPI","The strength of symmetric cryptography depends on _____.":"The Secret Key","An attacker can potentially gain access to sensitive data stored in a dump file on disk by crashing an application.":"True","Which one of the following is used to share the public key in Asymmetric Cryptography?":"Digital Signature","Which one of the following can best be used to protect stored passwords?":"Scrypt","Typical uses for symmetric cryptography include secure transport, exchange and storage of sensitive data.":"True","Which one of the following protects recorded sessions from being decrypted if the certificates are compromised in future?":"Ephemeral handshake algorithm","What type of risk is reduced with the use of TLS?":"Successful eavesdropping attacks","Which one of the following is the best choice for a certificate authentication algorithm?":"RSA","Which one of the following pieces of information identifies the owner of an X.509 certificate?":"Public key","Which one of the following is the most common attack vector for public key cryptography?":"Spoofing a key","Which one of the following is an acceptable use of self-signed certificates?":"Used for local testing","C ++ provides built in support for TLS protocol for secure communications.":"False","Self-signed certificates can be securely verified, and the client can reliably verify keys with each use.":"False","Which one of the following conditions is most likely to result in a cross-site scripting vulnerability?":"Untrusted data is embedded in web responses without validation or encoding","The ASP.NET MVC model binding process handles:":"Deserializing, mapping, and converting data into the properties of a model object","Which of the following is a common cross-site scripting pitfall?":"Creating your own encoding libraries","The ASP.NET MVC [Bind] attribute can be used to: ":"Specify which fields you want the model binder to handle","Which of the following is considered a secure coding best practice? ":"Sanity-checking results of SQL commands before displaying them","The correct encoding method to use when untrusted data will be embedded between two tags in a web response is:":"HtmlEncode","Which approach is the most effective way to prevent an over-posting or mass assignment attack?  ":"Use models specifically designed for views that accept user input","Using type-safe SQL command parameters when variables are included in an SQL statement can help mitigate SQL injection attacks by: ":"Marking input data as non-executables values ","A best practice to help prevent JSON hijacking is to:":"Avoid returning JSON arrays as responses","To help prevent under-posting attacks: ":"Set property as nullable so that the [Required] attribute properly validates ","One of the ways that ASP.NET MVC protects against cross-site scripting attacks is by:":"Identifying and blocking inputs containing HTML characters","For sensitive operations, you can supplement ASP.NET protection against CSRF attacks by:":"Requiring users to re-authenticate or provide a second factor of authentication","Which type of cross-site scripting attack is most likely to occur when a web application accepts inputs and echoes that input with insufficient data encoding by the server?":"Reflected cross-site scripting","To help prevent under-posting, set properties as nullable so that the [Required] attribute properly validates.":"True","The recommended way to perform input validation in an ASP.NET MVC is data annotation.":"True","Type-safe parameter objects can still cause SQL injection if they contain valid SQL commands.":"False","SQL injection attacks rarely occur on database management systems operating on established vendor platforms such as Microsoft, Oracle and IBM.":"False","One of the limitations of MVC CSRF protection is that it is only valid for HTTP POST requests; GET requests are not protected.":"True","The ASP.NET model binder cannot be enhanced or modified.":"False","The most important reason for using ASP.NET RequestValidation is because it can:":"Be enabled and disabled on a per-page basis","One of the widely accepted patterns for preventing cross-site request forgery (CSRF) is:":"Synchronizer token pattern","In order for ASP.NET developers to successfully utilize the MVC CSRF protection mechanism:":"The user’s browser must support cookies","To implement MVC CSRF protection, you must:":"Add the @Html.AntiForgeryToken directive to the view and add the [ValidateAntiForgeryToken] attribute to the controller actions you wish to protect","Lazy validation causes:":"Data to be validated only when requested","Which of the following can best be used to prevent Open URL Redirect?":"Never provide an open-ended redirector that accepts any target URL","MVC validation is more intelligent than traditional ASP.NET validation when applied to models.":"True","Sub-models are safe from over-posting attack vectors.":"False","A value from untrusted input data is assigned to a parameter, which is then bound to a parameter placeholder in a dynamic SQL statement, where the type of the parameter and its size are explicitly defined. The database engine will ignore any SQL commands embedded in the value.":"True","For authentication using local accounts, which OAuth2 grant type does Web API use?":"Resource Owner Credentials Grant","The most common form of OAuth2 authentication is:":"Authorization Code Grant","When the API receives a receives a request for a protected resource that contains valid credentials, but the user is not authorized to access the resources:":"The authorization filter rejects the request","When Web API receives a request for a protected resource that does not contain credentials:":"The authorization filter rejects the request","The ASP.NET Web API pipeline layers execute in the following order:":"Hosting, messaging handler, controller handler, action","When Web API receives a request for a protected resource that contains invalid credentials:":"The authentication filter rejects the request","Which one of the following requires that both endpoints share the same secret cryptographic key?":"Symmetric encryption","In the OAuth2 authorization model, the component that holds the protected resources being accessed with an access token is the:":"Resource Server","In the OAuth2 authorization model, the component that authenticates the end user and issues an access token is the:":"Authorization Server","In the OAuth2 authorization model, the component on which the software application runs (for example, a desktop, laptop, or mobile device) is the:":"Client","Which of the following best practices should be used to protect data in transit?":"Use TLS-encrypted communication protocol","What establishes the encryption level required to securely transmit sensitive data?":"SocketProtectionLevel","Which of the following features does OWIN middleware provide?":"Authentication interface","The messaging handling layer includes two special handlers:":"Routing and controller dispatchers","The authentication filter will immediately reject a request with invalid credentials and generate a 401 error. In this scenario, the request never reaches the:":"Authorization filters","For authentication using external entities, which OAuth2 grant type does Web API use?":"Authorization Code Grant","If your application includes HTML elements that use cookie authentication, you can safely allow that cookie to authenticate the user for another Web API call.":"False","With Resource Owner Credentials Grant, the user enters credentials in the client application, a token request is sent to the authorization endpoint on the server, and the server responds with an access token.":"True","When the API receives a request for a protected resource that contains valid credentials, but the user is not authorized to access them, the authentication filter rejects the request.":"True","The authentication and authorization filters work together to grant or deny access to the controller action method.":"True"}'